app/views/sessions/market.html.erb

           </tr>
           <% Product.all.each do |product| %>
---
SELECT "products".* FROM "products"