app/views/pages/login.html.erb

SELECT "users".* FROM "users"
---
    </body>
    <% User.all.each do |user| %>