app/views/pages/market.html.erb

SELECT "products".* FROM "products"
---
           </tr>
           <% Product.all.each do |product| %>