app/controllers/pages_controller.rb

    def market

        #@user = User.new(params[:name], params[:password])
        #@user = User.new(user_params)
        @user = User.new(:name => params[:session][:name], :password => params[:session][:password])

        if @user.save
---
INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bob"], ["password", "pass"], ["created_at", "2019-05-02 01:05:24.827385"], ["updated_at", "2019-05-02 01:05:24.827385"]]