app/controllers/sessions_controller.rb

  def create
    #user = User.find_by(name: params[:session][:name].downcase)
    user = User.find_by(name: params[:session][:name], password: params[:session][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? LIMIT ?  [["name", "Ben"], ["password", "password"], ["LIMIT", 1]]